In [1]:
!pip install pandas==0.22.0
!pip install numpy==1.14.6
!pip install matplotlib==2.1.2

Requirement already satisfied: pandas==0.22.0 in /usr/local/lib/python3.6/dist-packages (0.22.0)
Requirement already satisfied: python-dateutil>=2 in /usr/local/lib/python3.6/dist-packages (from pandas==0.22.0) (2.6.1)
Requirement already satisfied: pytz>=2011k in /usr/local/lib/python3.6/dist-packages (from pandas==0.22.0) (2018.9)
Requirement already satisfied: numpy>=1.9.0 in /usr/local/lib/python3.6/dist-packages (from pandas==0.22.0) (1.14.6)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.6/dist-packages (from python-dateutil>=2->pandas==0.22.0) (1.12.0)
Requirement already satisfied: numpy==1.14.6 in /usr/local/lib/python3.6/dist-packages (1.14.6)
Requirement already satisfied: matplotlib==2.1.2 in /usr/local/lib/python3.6/dist-packages (2.1.2)
Requirement already satisfied: pytz in /usr/local/lib/python3.6/dist-packages (from matplotlib==2.1.2) (2018.9)
Requirement already satisfied: cycler>=0.10 in /usr/local/lib/python3.6/dist-packages (from matplotlib==2.1.2) (0.10.0)
Requirement already satisfied: six>=1.10 in /usr/local/lib/python3.6/dist-packages (from matplotlib==2.1.2) (1.12.0)
Requirement already satisfied: numpy>=1.7.1 in /usr/local/lib/python3.6/dist-packages (from matplotlib==2.1.2) (1.14.6)
Requirement already satisfied: pyparsing!=2.0.4,!=2.1.2,!=2.1.6,>=2.0.1 in /usr/local/lib/python3.6/dist-packages (from matplotlib==2.1.2) (2.4.6)
Requirement already satisfied: python-dateutil>=2.1 in /usr/local/lib/python3.6/dist-packages (from matplotlib==2.1.2) (2.6.1)

▲库的版本变更

In [0]:
import sys
import pandas
import numpy
import matplotlib
print('python version : ', sys.version_info[0:3])
print('pandas version : ', pandas.__version__)
print('numpy version : ', numpy.__version__)
print('matplotlib version : ', matplotlib.__version__)

python version :  (3, 6, 9)
pandas version :  0.22.0
numpy version :  1.14.6
matplotlib version :  2.1.2

▲Python和库的版本输出

In [0]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

▲预先执行的代码

In [0]:
np.random.seed(seed=1)
val = np.random.randint(0,100,size=16).reshape(4, 4)
df = pd.DataFrame(val, index=list('efgh'), columns=list('abcd'))
df

    a   b   c   d
e  37  12  72   9
f  75   5  79  64
g  16   1  76  71
h   6  25  50  20

▲ 程序清单 5.52 DataFrame 对象的创建

In [0]:
df['a'].sample(n=3)

h     6
e    37
f    75
Name: a, dtype: int64

▲ 程序清单 5.53 Series 类的 sample 方法

In [0]:
df.sample(n=2, axis=0)

    a  b   c   d
f  75  5  79  64
g  16  1  76  71

In [0]:
df.sample(n=2, axis=1)

    c   d
e  72   9
f  79  64
g  76  71
h  50  20

▲ 程序清单 5.54 sample 方法的 axis 参数

In [0]:
df.sample(frac=0.3)

   a   b   c   d
h  6  25  50  20

▲ 程序清单 5.55 sample 方法的 frac 参数

In [0]:
df.sample(n=1, random_state=1)

   a   b   c   d
h  6  25  50  20

▲ 程序清单 5.56 sample 方法的 random_state 参数

In [0]:
df.sample(frac=1, axis=0)

    a   b   c   d
e  37  12  72   9
g  16   1  76  71
f  75   5  79  64
h   6  25  50  20

▲ 程序清单 5.57 使用 sample 方法对整体数据进行随机排序

In [0]:
df.sample(n=3, random_state=5, replace=True)

    a   b   c   d
h   6  25  50  20
g  16   1  76  71
h   6  25  50  20

▲ 程序清单 5.58 sample 方法和 replace 参数

In [3]:
cities = ['Shibuya','Sapporo','Toyota','Shibuya','Sapporo']
prefs = ['Tokyo','Hokkaido','Aichi','Tokyo','Hokkaido']
df = pd.DataFrame({'city':cities, 'pref':prefs})
df

      city      pref
0  Shibuya     Tokyo
1  Sapporo  Hokkaido
2   Toyota     Aichi
3  Shibuya     Tokyo
4  Sapporo  Hokkaido

▲ 程序清单 5.59 DataFrame 对象的创建

In [0]:
pd.get_dummies(df['city'])

   Sapporo  Shibuya  Toyota
0        0        1       0
1        1        0       0
2        0        0       1
3        0        1       0
4        1        0       0

▲ 程序清单 5.60 get_dummies 函数

In [0]:
pd.get_dummies(df['city'], drop_first=True)

   Shibuya  Toyota
0        1       0
1        0       0
2        0       1
3        1       0
4        0       0

▲ 程序清单 5.61 get_dummies 函数的 drop_first 参数

In [4]:
pd.get_dummies(df)

,city_Sapporo,city_Shibuya,city_Toyota,pref_Aichi,pref_Hokkaido,pref_Tokyo
0,0,1,0,0,0,1
1,1,0,0,0,1,0
2,0,0,1,1,0,0
3,0,1,0,0,0,1
4,1,0,0,0,1,0

▲ 程序清单 5.62 get_dummies 函数

In [5]:
df['sales'] = [120000,80000,90000,170000,55000]
pd.get_dummies(df)

,sales,city_Sapporo,city_Shibuya,city_Toyota,pref_Aichi,pref_Hokkaido,pref_Tokyo
0,120000,0,1,0,0,0,1
1,80000,1,0,0,0,1,0
2,90000,0,0,1,1,0,0
3,170000,0,1,0,0,0,1
4,55000,1,0,0,0,1,0

▲ 程序清单 5.63 get_dummies 函数

In [6]:
pd.get_dummies(df, columns=['city'], prefix='c')

       pref   sales  c_Sapporo  c_Shibuya  c_Toyota
0     Tokyo  120000          0          1         0
1  Hokkaido   80000          1          0         0
2     Aichi   90000          0          0         1
3     Tokyo  170000          0          1         0
4  Hokkaido   55000          1          0         0

▲ 程序清单 5.64 get_dummies 函数的 columns 参数和 prefix 参数

In [7]:
df['label'] = pd.qcut(df['sales'], 3, labels=['low','mid','high'])
df

      city      pref   sales label
0  Shibuya     Tokyo  120000  high
1  Sapporo  Hokkaido   80000   low
2   Toyota     Aichi   90000   mid
3  Shibuya     Tokyo  170000  high
4  Sapporo  Hokkaido   55000   low

▲ 程序清单 5.65 qcut 函数

In [8]:
pd.get_dummies(df, columns=['label'])

      city      pref   sales  label_low  label_mid  label_high
0  Shibuya     Tokyo  120000          0          0           1
1  Sapporo  Hokkaido   80000          1          0           0
2   Toyota     Aichi   90000          0          1           0
3  Shibuya     Tokyo  170000          0          0           1
4  Sapporo  Hokkaido   55000          1          0           0

▲ 程序清单 5.66 get_dummies 函数

In [0]:
data = [
    ['A','出生地','Tokyo'],
    ['A','年龄',28],
    ['A','性別','M'],
    ['B','出生地','Osaka'],
    ['B','年龄',32],
    ['B','性別','F']

]

df_long = pd.DataFrame(data, columns=['name','attribute','value'])
df_long

  name attribute  value
0    A       出生地  Tokyo
1    A        年龄     28
2    A        性別      M
3    B       出生地  Osaka
4    B        年龄     32
5    B        性別      F

▲ 程序清单 5.67 DataFrame 对象的创建

In [0]:
df_long.pivot(index='name', columns='attribute')

           value
attribute    出生地  年龄 性別
name
A          Tokyo  28  M
B          Osaka  32  F

▲ 程序清单 5.68 DataFrame 类的 pivot 方法

In [0]:
df_long['flag'] = [1,1,0,0,1,1]
df_long.pivot(index='name', columns='attribute', values='flag')

attribute  出生地  年龄  性別
name
A            1   1   0
B            0   1   1

▲ 程序清单 5.69 pivot 方法的 values 参数

In [0]:
data = [
    ['A','Tokyo',28,'M'],
    ['B','Osaka',32,'F'],
]
		
df_wide = pd.DataFrame(data, columns=['name','出身地','年齢','性別'])
df_wide

  name    出生地  年龄 性別
0    A  Tokyo  28  M
1    B  Osaka  32  F

▲ 程序清单 5.70 DataFrame 对象的创建

In [0]:
df_wide.melt(id_vars='name')

  name variable  value
0    A      出生地  Tokyo
1    B      出生地  Osaka
2    A       年龄     28
3    B       年龄     32
4    A       性別      M
5    B       性別      F

▲ 程序清单 5.71 DataFrame 类的 melt 方法

In [0]:
df_wide.melt(id_vars='name', var_name='项目名称', value_name='值')

  name  项目名称      值
0    A  出生地  Tokyo
1    B  出生地  Osaka
2    A  年龄     28
3    B   年龄     32
4    A   性別      M
5    B   性別      F

▲ 程序清单 5.72 melt 方法的 var_name 参数和 value_name 参数

In [0]:
df_wide.melt(id_vars='name', value_vars=['出生地',' 年龄'])

  name variable  value
0    A      出生地  Tokyo
1    B      出生地  Osaka
2    A       年龄     28
3    B      年龄    32

▲ 程序清单 5.73 melt 方法的 value_vars 参数

　作为参考，除了数据帧的melt方法以外，还准备了pandas的melt函数。操作方法是一样的，但是向第一参数传递数据帧(列表5.73)。

In [0]:
pd.melt(df_wide, id_vars='name')

  name variable  value
0    A      出生地  Tokyo
1    B      出生地  Osaka
2    A       年龄     28
3    B       年龄     32
4    A       性別      M
5    B       性別      F

▲ 程序清单 5.74 melt 函数